Revit 2027 API
ScheduleField.FieldIndex Property
 The index of the field in the containing ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int FieldIndex { get; }
Public ReadOnly Property FieldIndex As Integer
	Get
public:
property int FieldIndex {
	int get ();
}
member FieldIndex : int with get
Property Value
Int32
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace